In [1]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'grp': [1, 2, 1, 2, 1, 2],
                   'x': range(6, 0, -1),
                   'y': range(4, 10),
                   'z': [3, 4, 5, 6, 7, None]},
                   index = list('abcdef'))
df2 = pd.DataFrame({'grp': [1, 3], 'w': [10, 11]})

In [2]:
display(df)
display(df2)

   grp  x  y    z
a    1  6  4  3.0
b    2  5  5  4.0
c    1  4  6  5.0
d    2  3  7  6.0
e    1  2  8  7.0
f    2  1  9  NaN

   grp   w
0    1  10
1    3  11

In [3]:
df.loc['c']

grp    1.0
x      4.0
y      6.0
z      5.0
Name: c, dtype: float64

In [4]:
df[['z']].agg(['mean'])

        z
mean  5.0

In [5]:
df.assign(z1 = df['z'] + 1)

   grp  x  y    z   z1
a    1  6  4  3.0  4.0
b    2  5  5  4.0  5.0
c    1  4  6  5.0  6.0
d    2  3  7  6.0  7.0
e    1  2  8  7.0  8.0
f    2  1  9  NaN  NaN

In [6]:
df.assign(x_mean = df['x'].mean())[['x_mean', 'y']]

   x_mean  y
a     3.5  4
b     3.5  5
c     3.5  6
d     3.5  7
e     3.5  8
f     3.5  9